INSERT INTO films (title_rus, title, country, tagline, producer, genre, show_year, show_year_rus, duration) 
VALUES 
('Дневник памяти', 'The Notebook', 'США', 'За каждой большой любовью стоит большая история', 'Ник Кассаветис', 'драма, мелодрама', '2004-05-20', '2004-10-14', '124');

INSERT INTO actors (name, date_of_birth, place_of_birth, sex, intresting_facts) 
VALUES 
('Ryan Gosling', '1980-11-12', 'Лондон, Онтарио, Канада', 'm', 'В детстве был членом Клуба Микки Мауса, в котором вместе с ним в свое время состояли Бритни Спирс, Кристина Агилера и Джастин Тимберлейк.'),
('Rachel McAdams', '1978-11-17', 'Лондон, Онтарио, Канада', 'f', 'Актриса родилась в одной больнице с Райаном Гослингом, с которым впоследствии сыграла в фильме «Дневник памяти».'),
('Kathryn Newton', '1997-02-08', 'Калифорния, США', 'f', ''),
('Jacques Colimon', NULL, '', 'm', '');

INSERT INTO actors_films (film_id, actor_id)
VALUES 
(1,1),
(1,2);


INSERT INTO roles_films (name, actor_film)
VALUES
('Noah Calhoun', '1'),
('Allison "Allie" Hamilton', '2');

INSERT INTO users (login, first_name, last_name, date_of_birth, sex)
VALUES
('innocentlake', 'Юлия', '', '1988-04-21', 'f'),
('squirrelwithbong', '', '', NULL, 'm'),
('timetoti', 'Владислав', 'Шишков', '2019-02-21', 'm'),
('Liquid', 'Михаил', 'Цуркан', '1987-11-20', 'm');

INSERT INTO users_films (user_id, film_id)
VALUES
(1,1),
(4,1);

INSERT INTO serials (title_rus, title, country, tagline, producer, genre, show_year, released)
VALUES
('Общество', 'The Society', 'США', 'No One to Save Us, But Us', 'Марк Уэбб', 'драма, фантастика', '2019-05-10', TRUE);

INSERT INTO actors_serials (serial_id, actor_id)
VALUES
(1,3),
(1,4);

INSERT INTO seasons (num_of_season, serial_id,  show_year, released)
VALUES
(1, 1, '2019-05-10', TRUE),
(2, 1, NULL, FALSE);

INSERT INTO series (num_of_seria, season_id, show_year, duration, released, title)
VALUES
(1, 1, '2019-05-10', 64, TRUE, 'What Happened?'),
(2, 1, '2019-05-10', 64, TRUE, 'Our Town'),
(3, 1, '2019-05-10', 64, TRUE, 'Childhood\'s End'),
(4, 1, '2019-05-10', 64, TRUE, 'Drop by Drop'),
(5, 1, '2019-05-10', 64, TRUE, 'Putting on the Clothes'),
(6, 1, '2019-05-10', 64, TRUE, 'Like A F-ing God or Something'),
(7, 1, '2019-05-10', 64, TRUE, 'Allie\'s Rules'),
(8, 1, '2019-05-10', 64, TRUE, 'Poison'),
(9, 1, '2019-05-10', 64, TRUE, 'New Names'),
(10, 1, '2019-05-10', 64, TRUE, 'How It Happens');

INSERT INTO users_serials (user_id, serial_id)
VALUES
(2,1),
(3,1);

INSERT INTO comments_serials (title, user_serial, body)
VALUES
('', 1, 'Это моя первая рецензия, так что попрошу не судить строго.

С начала хотел бы пройтись по очевидным плюсам и минусам данного творения. Из плюсов больше всего хотелось бы выделить операторскую и монтажную работу. Многие моменты (особенно запомнился кадр отъезда автобусов от школы снятый сверху) сделаны так хорошо, что заставляют испытывать эстетические микрооргазмики. И хорошую актерскую игру, не могу выделить кого-то конкретно, да и знаю я лишь Кэтрин Ньютон, на мой взгляд все справились просто отлично. И весьма хороший сюжет, нудных и скучных моментов не заметил.

Что касается минусов, то к сожалению в сериале можно заметить обильное количество киноляпов. Что и неудивительно, ведь, так как я понял, сценарий для каждой серии писали разные люди. И лично для меня это пожалуй все. Иррациональные и глупые действия персонажей, на мой взгляд, нельзя назвать минусом, так как это может быть творческой задумкой. Да и ожидать построения идеального общества среди подростков не совсем правильно, ведь даже в реальном мире это не так. Причиной этого является человеческий фактор, на который в сериале обратили огромное внимание.

Так же хотелось бы обратить внимание на не совсем понятый мне посыл. Возможно этот сериал в себе его и не несет, сделанный исключительно в целях развлечения. В таком случае вопросов нет, как вариант для просмотра в целях расслабиться и не вдумываться он очень хорош. А возможно он все-таки присутствует, вопросы порядка и закона, условий существования, классы в обществе, власти и многое другое без труда можно заметить. Вопрос в том какой в этом посыл, если он есть. Частые упоминания того, что прежняя жизнь была намного лучше, можно интерпретировать как обычную тоску по близким, так и идею того, что наше общество работает идеально и лучше быть не может. Основной аудиторией сериала являются подростки, так что это дает пищу для размышлений.

Всё-таки каждый видит этот мир и данный сериал в частности через свои «очки» и интерпретирует все по-своему. В любом случае рекомендую к просмотру.'),
('Общество и как его построить подросткам', 2, 'Сериал «Общество» нельзя назвать обычной подростковой драмой. Конечно, данная тема поднимается, но основной идеей сериала является вопрос о построении сообщества, социальной среды в условиях отсутствия какого-либо контроля. Кто-то из персонажей будет пытаться вернуться в привычный мир (или хотя бы пытаться понять что с ним случилось), кто-то будет пробовать строить свой порядок, кто-то будет просто стараться забыться. Перед героями встаёт вопрос: действовать в интересах общества или в своих собственных интересах?

Радует проработанная атмосфера, затягивающая как в мистику, так и в другие вопросы повседневности. Авторы сериала нашли практически идеальный баланс между важными вопросами жизни в новом мире.

Без минусов не обошлось, и многим они могут показаться критичными (смотреть или не смотреть — решать вам). Необоснованность поступков и откровенную тупость некоторых персонажей можно списать на то, что они подростки, но временами это заводит сюжетную линию в такие ситуации, что единственный вопрос, которым ты задаешься — «Как вообще до такого дошло?». По большей части такую несуразицу замечаешь только после середины сезона.

Лично меня сериал заинтересовал, и я жду продолжения. В какой-то мере сериал можно сравнить с «LOST», где всех героев заменили на подростков.');

INSERT INTO ratings_serials (value, user_serial)
VALUES
(8, 1),
(7, 2);

INSERT INTO roles_serials (name, actor_serial)
VALUES
('Allie Pressman', 1),
('Will LeClair', 2);


INSERT INTO comments_films (title, user_film, body)
VALUES
('Ни смотря на все различия', '1', 'Все те, кто, когда-либо становились перед выбором: родители или любимый, общественное мнение или счастье, деньги или жизнь, те ни на секунду не задумываюсь, посмотрят этот фильм. Более страстной драмы я не встречали, да кто-то скажет, что она написана в лучших традициях любовных романов, но ведь каждому из нас необходимо, будь нам 30-ть, 12-ть или 60-т лет, поверить в чудо и сказку.

Поверить в то, что она выберет Ноя, поверить в то, что можно умереть в один день и в то, что даже через 50-т лет совместной жизни можно страстно и беззаветно любить, что даже через 10-ть лет разлуки можно случайно встретиться на улице и всё вернётся. Нам необходимо в это верить, ведь каждый раз, когда мы ругаемся с любимыми нам нужно знать, что «ты передохнёшь пару секунд, и всё будет нормально, такое уже было».

Это всё необходимо нам, не исправимым романтикам, которых даже шипы и обиды разочарований не в силах заставить позабыть о прекрасном, о мелочах, которые могут радовать сердце. Пачкаться мороженным, плавать в реке, встречать после работы, учить водить машину, цветы на подушке, блинчики на завтрак после страстной ночи, мольберт для рисования, путь к которому выложен лепестками роз, потому что рисование — это для души или построить дом такой, о котором мечтал сам и жить в нём с ней. Это всего лишь мелочи, но значат они столько, сколько бы не значили тысячи слов сказанных вслух.

«И пусть будет нелегко, пусть будет тяжело и придётся работать над этим каждый день, и я хочу это сделать, потому, что я хочу, что бы ТЫ была моей, я хочу, что бы ты принадлежала мне всем и всегда. И я… сделай кое-что… нарисуй мне свою жизнь, через тридцать лет, через сорок, какой она будет. …. Но не ищи простого выхода!

Они не слишком часто соглашались друг с другом, на самом деле они вообще никогда не соглашались, между ними шла постоянная борьба, каждый день они бросали друг другу вызов, но, ни смотря на все различия, у них было то, что объединяло их, они были без ума друг от друга!» (с)

Вот чего хочу я, каждый раз, когда в чём-то не соглашаюсь или расхожусь во мнении с любимым человеком, вот к чему я возвращаюсь каждый раз, когда становится очень больно, и каждый раз я понимаю одно — ни смотря на все различия, я без ума от него!'),
('', 2, 'Этот фильм подарил мне веру в настоящую, трогательную, сложную, всеобъемлющую, стирающую все препятствия, неподвластную времени, удивительную любовь.

В наше время вера в такие светлые чувства как бы притупляется от быта и реалий современной жизни. Этот фильм помогает вспомнить о том для чего действительно стоит жить — для любви… вечной любви. Знаете, после просмотра, так захотелось найти свою половинку, как нашли герои фильма и полюбить так же сильно и безответственно.

В общем, я получил при просмотре огромное количество эмоций, мое сердце подтаяло и налилось верой в настоящую любовь!
');

INSERT INTO ratings_films (value, user_film)
VALUES
(10, 1),
(10, 2);








